# Ans.-1

In [3]:
import pandas as pd

In [4]:
#Creating a series

In [5]:
S = pd.Series([4,8,15,16,23,42])

In [6]:
#printing the series

In [7]:
S

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Ans.-2

In [8]:
#Creating a list containing 10 elements

In [9]:
a = [5,10,15,20,25,30,35,40,45,50]

In [11]:
#Applying pandas.series on variable (converting list into series)

In [12]:
G = pd.Series(a)

In [13]:
#Printing the series

In [14]:
G

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int64

# Ans.-3

In [15]:
#Creating a dataframe with a given data

In [17]:
df = pd.DataFrame({ 'Name': ['Alice','Bob','Claire'],
                    'Age': [25,30,27],
                    'Gender': ['Female','Male','Female']})

In [18]:
#Printing the dataframe

In [19]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Ans.-4

In [51]:
''' A DataFrame is a 2-dimensional labeled data structure with columns that can be of different data types (e.g., numeric, string, boolean, etc.).DataFrame is typically used for storing and manipulating tabular data, while Series is a 1-dimensional labeled array that can hold data of any type. It is often used to represent a single column of data within a DataFrame (Each column in a DataFrame is essentially a Series).'''

' A DataFrame is a 2-dimensional labeled data structure with columns that can be of different data types (e.g., numeric, string, boolean, etc.).DataFrame is typically used for storing and manipulating tabular data, while Series is a 1-dimensional labeled array that can hold data of any type. It is often used to represent a single column of data within a DataFrame (Each column in a DataFrame is essentially a Series).'

In [20]:
# Creating a dataframe

In [21]:
df1 = pd.DataFrame({ 'Name': ['Saurabh','Priyans','Deep'],
                     'Mobile_no.': [9434853258,9842415430,9258444627],
                     'Email_ID': ['abc@gmail.com','xyz@gmail.com','pqr@gmail.com']})

In [22]:
# Printing the dataframe

In [23]:
df1

      Name  Mobile_no.       Email_ID
0  Saurabh  9434853258  abc@gmail.com
1  Priyans  9842415430  xyz@gmail.com
2     Deep  9258444627  pqr@gmail.com

In [24]:
# Here in above dataframe every column is a series in itself
# Let us take out one series and store it in a variable

In [26]:
sr = pd.Series(df1['Name'])

In [27]:
sr

0    Saurabh
1    Priyans
2       Deep
Name: Name, dtype: object

In [28]:
type(df1)

pandas.core.frame.DataFrame

In [29]:
type(sr)

pandas.core.series.Series

# Ans.-5

In [52]:
'''Functions to manipulate dataframe are:
1. df.drop() : used to delete any row or column
2. df.dropna() : used to delete any row or column containing null values
3. df.set_index('col') : It make given column as index
4. df.fillna('xyz') : It will fill null values with given input value, etc. functions are used to manipulate Dataframe

"Functions to manipulate dataframe are:\n1. df.drop() : used to delete any row or column\n2. df.dropna() : used to delete any row or column containing null values\n3. df.set_index('col') : It make given column as index\n4. df.fillna('xyz') : It will fill null values with given input value, etc. functions are used to manipulate Dataframe"

In [32]:
# Taking datframe from ans.-4 and droping one of the row

In [33]:
df1

      Name  Mobile_no.       Email_ID
0  Saurabh  9434853258  abc@gmail.com
1  Priyans  9842415430  xyz@gmail.com
2     Deep  9258444627  pqr@gmail.com

In [34]:
df1.drop(1)

      Name  Mobile_no.       Email_ID
0  Saurabh  9434853258  abc@gmail.com
2     Deep  9258444627  pqr@gmail.com

# Ans.-6

# DataFrame is only mutable in nature whereas series and panel are immutable in nature. Only data can be added to series but cannot be manipulated whereas in DataFrame we can add additional data and also can manipulate the data.

# Ans.-7

In [42]:
# Creating multiple series in which we will store student name, age, marks in physics, chemistry and maths.

In [43]:
name = pd.Series(['Saurabh','Satyam','Vansh','Ridham','Harsh'])

In [44]:
age = pd.Series([20,21,20,22,22])

In [45]:
phy = pd.Series([98,92,94,90,90])

In [46]:
che = pd.Series([89,90,91,92,94])

In [47]:
math = pd.Series([100,95,90,90,91])

In [48]:
# creating a dataframe from the multiple series

In [49]:
df2 = pd.DataFrame({ 'Name': name, 
                     'Age': age,
                     'Physics_marks': phy,
                     'Chemistry_marks': che,
                     'Maths_marks' : math})

In [50]:
df2

      Name  Age  Physics_marks  Chemistry_marks  Maths_marks
0  Saurabh   20             98               89          100
1   Satyam   21             92               90           95
2    Vansh   20             94               91           90
3   Ridham   22             90               92           90
4    Harsh   22             90               94           91